oriflame/src/test/resources/real_files/pior_com_7610996_16102015_133030.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <INBOUND_ORDER_RECEIPT xmlns="urn:ifsworld-com:schemas:post_inbound_order_receipt">
            <DATE_CREATED>2015-10-16T00:00:00.000+00:00</DATE_CREATED>
            <DELIVERY_DATE>2015-10-16T00:00:00.000+00:00</DELIVERY_DATE>
            <INBOUND_COMPLETE>1</INBOUND_COMPLETE>
            <ORDER_NO>510699</ORDER_NO>
            <ORDER_TYPE>CUSTOMERRETURN</ORDER_TYPE>
            <REMARKS>Zoltan Gergely</REMARKS>
            <SITE>DCBUD</SITE>
            <VENDOR_NO>BUD</VENDOR_NO>
            <INBOUND_ORDER_RECEIPT_PALLETS>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUMMY</BATCH_NO>
                            <BOX_SIZE>22.0</BOX_SIZE>
                            <BOX_WEIGHT>0.0</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>330499000000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>510699</DELNOTE_NO>
                            <EXPIRY_DATE>2015-10-16T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>15570.1</PART_NO>
                            <QUANTITY>66.0</QUANTITY>
                            <REMARKS>N</REMARKS>
                            <SEQUENCE_NO>2.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUMMY</BATCH_NO>
                            <BOX_SIZE>280.0</BOX_SIZE>
                            <BOX_WEIGHT>6.44</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>330499000000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>510699</DELNOTE_NO>
                            <EXPIRY_DATE>2015-10-16T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>1276.1</PART_NO>
                            <QUANTITY>280.0</QUANTITY>
                            <REMARKS>N</REMARKS>
                            <SEQUENCE_NO>1.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
            </INBOUND_ORDER_RECEIPT_PALLETS>
        </INBOUND_ORDER_RECEIPT>
    </soap:Body>
</soap:Envelope>